blackleakz/-NodeMCUv3-esp8266-WiFi-Repeater-Range-extender-/source/oled-board/opensource/release/backport/main.cpp
      msg += "<center><div>";
      msg += "<input type=\"radio\" id=\"";
      msg += String(i);
      msg += "\" ";
      msg += "name=\"SSIDs\" value=\"";
      msg += String(i);
      msg += "\">";
      msg += "<label for=\"";
      msg += String(i);
      msg += "\"";
      msg += ">";
      msg += String(i + 1);
      msg += ": ";
      msg += WiFi.SSID(i);
      msg += " (";
      msg += String(WiFi.RSSI(i));
      msg += ")";
      msg += (WiFi.encryptionType(i) == ENC_TYPE_NONE) ? " " : "*";
      msg += "</label>";
      msg += "</div></body></html>";
      delay(10);
      wifi_oledscan();
      }
      server.send(200, "text/html", msg);
  });
  
//server.onNotFound(handleNotFound);
    server.onNotFound([]() {
      server.send(404, "text/plain", "How the heck did you get here?");
  });

// server.on("/repeater", handleRepeater);
// Button-connected redirect function to redirect to Repeater-config site
 server.on("/repeater", []() {
  // BEGIN OF REPEATER_CONFIGURATION-SITE CONTENT AND CPP-FUNCTIONS WHICH SETS THE RIGHT VARIABLES FOR THE HTML-CONTENT
      server.send(200, "text/html", msx);
  });


// server.on("/otaupdate", handleOTAUpdate);
  server.on("/otaupdate", []() {
      server.send(200, "text/html", otaupdate);
  });

 
    server.on("/stasettings", []() {
      String temp = server.arg("SSIDs");
      int number = temp.toInt();
      String stassid = networks[number];
      String stapsk = server.arg("stapsk");
      if (stassid.length() > 0) {
        server.send(200, "text/plain", "Settings Recieved");
        Serial.printf("\n\nAttempting to connect to '%s' using password '%s' \n", stassid.c_str(), stapsk.c_str());
        WiFi.persistent(true);
        WiFi.begin(stassid, stapsk);
        testwifi();
    }
  });
// server.on("/stasettings", handleStasettings);
 // Permanent SSID AND PASSPHRASE TO ROUTER 2 connect to
//  server.on("/stasettings", []() {
  //  String temp = server.arg("SSIDs");
 // /(/())  int number = temp.toInt();
  //  String stassid = networks[number];
  //  String stapsk = server.arg("stapsk");
   // if (stassid.length() > 0) {
   //   String cat;
   //   cat = "<DOCTYPE html><html><title>Settings recieved</title></html>";
   //   cat += "<head><h1>Settings recieved.</h1></head></html>";
    //  server.send(200, "text/html", cat);
     // Serial.printf("\n\nConsole<>> Attempting to connect to '%s' using password '%s' \n", stassid.c_str(), stapsk.c_str());
      
      
     // WiFi.persistent(true);
    //  WiFi.begin(stassid, stapsk);
    //  testwifi();
   //   display.clearDisplay();
   //   display.setCursor(0,0);
 //     display.println("Trying to connect to: ");
   //   display.display();
     // display.setCursor(0,10);
      //display.display();
      //display.setCursor(0,20);
      //display.display();
//      77run_oled_loop();
    //}
  //});


  // server.on("/temstasettings", handleTmpStasettings);
 // Temporary SSID AND PASSPHRASE TO ROUTER 2 connect to
  server.on("/tempstasettings", []() {
    String temp = server.arg("SSIDs");
    int number = temp.toInt();
    String stassid = networks[number];
    String stapsk = server.arg("stapsk");
    if (stassid.length() > 0) {
      String cat;
      cat = "<DOCTYPE html><html><title>Settings recieved</title></html>";
      cat += "<head><h1>Settings recieved.</h1></head></html>";
      server.send(200, "text/html", cat);
      Serial.printf("\n\nConsole<>> Attempting to connect to '%s' using password '%s' \n", stassid.c_str(), stapsk.c_str());
      display.clearDisplay();
      display.setCursor(0,0);
      display.println("Connecting to: ");
      display.display();
      display.setCursor(0,10);
      display.println(stassid);
      display.display();
      display.setCursor(0,20);
      display.println(stapsk);
      display.display();
      run_oled_loop();
      WiFi.persistent(false);
      WiFi.begin(stassid, stapsk);
      testwifi();
    }
  });
 

 // server.on("/apsettings", handleApsettings);
 // Permanent Repeater-Config
  server.on("/apsettings", []() {
    String apssid = server.arg("apssid");
    String appsk = server.arg("appsk");
    if (apssid.length() > 0) {
      server.send(200, "text/plain", "Settings Recieved");
    //  String cat;
     // cat = "<DOCTYPE html><html><title>Settings recieved</title></html<>";
     // cat += "<head><h1>Settings recieved.</h1></head></html>";
     // server.send(200, "text/html", cat);
      Serial.printf("\n\nConsole<>> Setting AP Credentials \nSSID: %s \nPassword: %s \n", apssid.c_str(), appsk.c_str());
      
      WiFi.persistent(true);
      WiFi.softAP(apssid, appsk);
      display.clearDisplay();
      display.setCursor(0,0);
      display.println("Settings recived.");
      display.display();
      display.setCursor(0,10);
      display.println("Permanent AP:");
      display.display();
      display.setCursor(0,20);
      display.display();
      display.setCursor(0,30);
      display.display();
    }
  });
 

  // server.on("/tempapsettings", handleTempapsettings);
 // Temporary Repeater-AP-SSID setting
  server.on("/tempapsettings", []() {
    String apssid = server.arg("apssid");
    String appsk = server.arg("appsk");
    if (apssid.length() > 0) {
      String cat;
      cat = "<DOCTYPE html><html><title>Settings recieved</title>";
      cat += "<head><h1>Settings recieved.</h1></head></html>";
      server.send(200, "text/html", cat);
      Serial.printf("\n\nConsole<>> Setting Temporary AP Credentials \nSSID: %s \nPassword: %s \n", apssid.c_str(), appsk.c_str());
      display.clearDisplay();
      display.setCursor(0,0);
      display.println("Settings recived.");
      display.display();
      display.setCursor(0,10);
      display.println("Temporary AP:");
      display.display();
      display.setCursor(0,20);
      display.println(apssid.c_str());
      display.display();
      display.setCursor(0,30);
      display.println(appsk.c_str());
      display.display();
      WiFi.persistent(false);
      WiFi.softAP(apssid, appsk);
    }
  });


// server.on("/reboot", handleReboot);
 // Reboot function 
  server.on("/reboot", []() {
    String cat;
      cat = "<DOCTYPE html><html><title>REBOOT</title>";
      cat += "<head><h1>Rebooting...</h1></head></html>";

      server.send(200, "text/html", cat);
    delay(5000);
    ESP.reset();
  });
 
//here the list of headers to be recorded
  const char * headerkeys[] = {"User-Agent","Cookie"} ;
  size_t headerkeyssize = sizeof(headerkeys)/sizeof(char*);
//ask server to track these headers
  server.collectHeaders(headerkeys, headerkeyssize );   
// redirect to repeater-settings site, connected by html button defined in index_html

