blackleakz/-NodeMCUv3-esp8266-WiFi-Repeater-Range-extender-/source/oled-board/opensource/release/backport/main.cpp
}




 // SETUP
  void setup() {
    // Begin of serial-comunication with a baudrate of 115200
    Serial.begin(115200);
    Serial.println("Console<>> Console started."); // prints smth  to serial.com
// Define BUILTIN-LED to LED_BUILTIN, OUTPUT and let it blink
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN, LOW);
    delay(300);
    digitalWrite(LED_BUILTIN, HIGH);
    delay(400);
    digitalWrite(LED_BUILTIN, LOW);

    Serial.println("Console<>> Initialize display.");
  // Initializes oledssd1306 display, if error, serial.com sents msg
    if(!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
      Serial.println(F("SSD1306 allocation failed"));
      for(;;);
    }
    delay(500);
    display.display(); // init display
    display.setTextColor(WHITE); // set Text-color
    display.setTextSize(1); // set text size
    display.setCursor(0,0); // set cursor position / table
    display.println("Console<>>"); // displays string 
    display.display(); // needs to be called to initialize the displaying of string in command before
    display.setCursor(0,10);
    display.println("Started.");
    display.display();
    delay(1000);
    display.clearDisplay();
                             // Start the SPI Flash Files System
   // if (!MDNS.begin("blackleakz")) {             // Start the mDNS responder for esp8266.local
   // Serial.println("Console<>> Error setting up MDNS responder!");
   // }
   // Serial.println("mDNS responder started");

    delay(1000);
    Serial.printf("\n\nConsole<>> NAPT Range extender\n");
    Serial.printf("Console<>> Heap on start: %d\n", ESP.getFreeHeap());

  #if HAVE_NETDUMP
    phy_capture = dump;
  #endif
  //ESP8266WiFi SETTINGS
    WiFi.setPhyMode(WIFI_PHY_MODE_11N); // Set radio type to N
    WiFi.mode(WIFI_AP_STA); // SET MODE TO both AP+Client named AP_STA
    WiFi.persistent(false);
    WiFi.begin(); // Use stored credentials to connect to network
    testwifi(); // Starts TESTFUNCTION
    WiFi.softAPConfig(  // Set IPv4 Address, Gateway and Subnet
      IPAddress(192, 168, 4, 1), 
      IPAddress(192, 168, 4, 1),
      IPAddress(255, 255, 255, 0));
 //   WiFi.softAP("BlackLeakz",  "1234567890"); // Use stored credentials to create AP
      WiFi.softAP(WiFi.softAPSSID(), WiFi.softAPPSK()); // Use stored credentials to create AP
    
// Print to serial output the SSID and PASSPHRASE
    Serial.println("Console<>> SSID: " + WiFi.softAPSSID() + "\n\nPASSPHRASE: " + WiFi.softAPPSK());
// OLED DISPLAY PRINTS SSID, KEY AND IP TO SCREEN
    display.setCursor(0,0);
    display.println("SSID:");
    display.display();
    display.setCursor(0,10);
    display.println(WiFi.softAPSSID());
    display.display();
    display.setCursor(0,20);
    display.println("KEY:");
    display.display();
    display.setCursor(0,30);
    display.println(WiFi.softAPPSK());
    display.display();
    delay(100);
    display.clearDisplay();
    display.setCursor(0,0);
    display.println("IP:");
    display.display();
    display.setCursor(0,10);
    display.println(WiFi.localIP());
    display.display();
    display.setCursor(0,20);
    display.println(WiFi.softAPIP());
    display.display();
    delay(100);
  //  run_oled_loop();



    Serial.printf("Console<>> Heap before: %d\n", ESP.getFreeHeap());
    err_t ret = ip_napt_init(NAPT, NAPT_PORT);
    Serial.printf("Console<>> ip_napt_init(%d,%d): ret=%d (OK=%d)\n", NAPT, NAPT_PORT, (int)ret, (int)ERR_OK);

    if (ret == ERR_OK) {
      ret = ip_napt_enable_no(SOFTAP_IF, 1);
      Serial.printf("ip_napt_enable_no(SOFTAP_IF): ret=%d (OK=%d)\n", (int)ret, (int)ERR_OK);
      if (ret == ERR_OK) {
    }
  }
    Serial.printf("Console<>> Heap after napt init: %d\n", ESP.getFreeHeap());
    if (ret != ERR_OK) {
      Serial.printf("Console<>> NAPT initialization failed\n");
    }
    serverconfig();
    // BEGIN OF ARDUINO OTA_UPDATE SERVER SECTION
   //  ArduinoOTA.onStart([]() {
    // /'Serial.println("Start");
    // });
    // ArduinoOTA.onEnd([]() {
    //   Serial.println("\nEnd");
    // });
    // ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    //  Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
    // });
    // ArduinoOTA.onError([](ota_error_t error) {
    //   Serial.printf("Error[%u]: ", error);
    //   if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    //   else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    //   else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    //   else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    //   else if (error == OTA_END_ERROR) Serial.println("End Failed");
    // });
    // ArduinoOTA.begin(); 
    
    display.clearDisplay();
    display.setCursor(0,0);
    display.println("IP: ");
    display.display();
    display.setCursor(0,10);
    display.println(WiFi.localIP());
    display.display();
    display.setCursor(0,20);
    display.println(WiFi.softAPIP());
    display.display();
  }
 
  #else
  void setup() {
    Serial.begin(115200);
    Serial.printf("\n\nConsole<>> NAPT not supported in this configuration\n");
  }
  #endif
 
 // LOOP
  void loop() {
    server.handleClient();
// Displays localip / softAPIP in a loop to oled-screen
    
    // Function which lets the led blink while connected or of not connected = no Blinking.
    if (WiFi.status() != WL_CONNECTED) {
      digitalWrite(LED_BUILTIN, LOW);
      delay(1000);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(1000);
  }
    else {
      digitalWrite(LED_BUILTIN, HIGH);
  }
  // ENd Func
 }// END LOOP
  
